{
  "examples": [
    {
      "id": "1",
      "intent": "nearby",
      "language": "hr",
      "question": "Gdje u blizini imaju dobru pizzu?",
      "response": "U blizini imate nekoliko odličnih opcija za pizzu. Taverna Alinea na 0.5 km ima autentičnu talijansku pizzu, a Marabu caffe & pizzeria na 0.3 km nudi raznovrsne varijante. Oba su trenutno otvorena. Koji vam se čini najzanimljiviji?",
      "createdAt": "2025-09-12T07:28:17.271Z"
    },
    {
      "id": "2",
      "intent": "nearby",
      "language": "en",
      "question": "Where nearby has good pizza?",
      "response": "You have several great pizza options nearby. Taverna Alinea at 0.5 km offers authentic Italian pizza, while Marabu caffe & pizzeria at 0.3 km has diverse varieties. Both are currently open. Which one interests you most?",
      "createdAt": "2025-09-12T07:28:17.272Z"
    },
    {
      "id": "3",
      "intent": "menu_search",
      "language": "hr",
      "question": "Ima li restoran Vatikan pizzu?",
      "response": "Da, restoran Vatikan ima odličnu pizzu u svom jelovniku. Imaju Margherita za 12 €, Capricciosa za 15 € i Quattro Stagioni za 16 €. Svi su napravljeni s autentičnim talijanskim sastojcima. Želite li znati više o sastojcima?",
      "createdAt": "2025-09-12T07:28:17.272Z"
    },
    {
      "id": "4",
      "intent": "menu_search",
      "language": "en",
      "question": "Does Vatikan restaurant have pizza?",
      "response": "Yes, Vatikan restaurant has excellent pizza on their menu. They offer Margherita for 12 €, Capricciosa for 15 €, and Quattro Stagioni for 16 €. All are made with authentic Italian ingredients. Would you like to know more about the ingredients?",
      "createdAt": "2025-09-12T07:28:17.272Z"
    },
    {
      "id": "5",
      "intent": "hours",
      "language": "hr",
      "question": "Radi li restoran Vatikan nedjeljom?",
      "response": "Nažalost, restoran Vatikan je nedjeljom zatvoren. Radi od ponedjeljka do subote od 10:00 do 22:00. Trebate li rezervaciju za neki drugi dan?",
      "createdAt": "2025-09-12T07:28:17.272Z"
    },
    {
      "id": "6",
      "intent": "hours",
      "language": "en",
      "question": "Is Vatikan restaurant open on Sunday?",
      "response": "Unfortunately, Vatikan restaurant is closed on Sundays. They're open Monday through Saturday from 10:00 to 22:00. Do you need a reservation for another day?",
      "createdAt": "2025-09-12T07:28:17.272Z"
    },
    {
      "id": "1757662534726",
      "intent": "nearby",
      "language": "hr",
      "question": "Gdje u blizini imaju dobru pizzu?",
      "response": "U blizini imate nekoliko odličnih opcija za pizzu! Taverna Alinea na 0.5 km ima autentičnu talijansku pizzu s velikim porcijama, a Marabu caffe & pizzeria na 0.3 km nudi raznovrsne varijante i prijateljsku atmosferu. Oba su trenutno otvorena i imaju odlične ocjene. Koji vam se čini najzanimljiviji?",
      "createdAt": "2025-09-12T07:35:34.726Z"
    },
    {
      "id": "1757662543796",
      "intent": "menu_search",
      "language": "hr",
      "question": "Ima li restoran Vatikan pizzu?",
      "response": "Da, restoran Vatikan ima odličnu pizzu u svom jelovniku! Imaju Margherita za 12 €, Capricciosa za 15 € i Quattro Stagioni za 16 €. Svi su napravljeni s autentičnim talijanskim sastojcima i velikim porcijama koje su vrlo popularne među gostima. Želite li znati više o sastojcima ili imate neko drugo pitanje?",
      "createdAt": "2025-09-12T07:35:43.796Z"
    },
    {
      "id": "1757662551880",
      "intent": "hours",
      "language": "hr",
      "question": "Radi li restoran Vatikan nedjeljom?",
      "response": "Da, restoran Vatikan radi i nedjeljom! Radno vrijeme je od 11:00 do 22:00, tako da možeš uživati u njihovim specijalitetima i za vikend. Ako planiraš posjetu pred zatvaranje, preporučujem da dođeš malo ranije kako bi uživao u jelu bez žurbe. Trebate li rezervaciju?",
      "createdAt": "2025-09-12T07:35:51.880Z"
    }
  ]
}